import re

from main import *


TEST_CASES_1 = (
    (
        ("11[<{==[[<{=]f[<{[{=",), 2,
    ),
    (
        ("[<{=",), 1,
    ),
    (
        ("[d <{ [<{==[[[<{=[< {=",), 2,
    ),
    (
        ("lolll[<{|= [<{ =",), 0,
    ),
    (
        ("00[<{1=[<[[<{=<{=",), 1,
    ),
)

TEST_CASES_2 = (
    (
        ("Кривошеее существо гуляет по парку",), ["гуляет"],
    ),
    (
        ("телефон гаайка!! (оптоом) %!!!_потом",), ["гаайка", "оптоом"],
    ),
    (
        ("лучшая??!!!!!! нуууу КаФеДРа это ЭЭЭээ ВТ",), ["лучшая", "ЭЭЭээ"],
    ),
    (
        ("2 гласные: ооооопоопо",), ["гласные"],
    ),
    (
        ("ооооооо бббоо бб",), ["ооооооо", "бббоо"],
    )
    
)

TEST_CASES_3 = (
    (
        ("КоРмА КоРкА КоРчмА", "к", "р", "а", 1), ["КоРмА"],
    ),
    (
        ("абввгод в год вогодо воагоад вовгоодо", "в", "г", "д", 2), ["воагоад"],
    ),
    (
        ("привет как дела делдел делл", "д", "е", "л", 0), ["дела"],
    ),
    (
        ("около оооооооооо ококококококо окколло ооооокколло", "о", "о", "о", 2), ["окколло"],
    ),
    (
        ("да я не знаю уже что придумать пусть будет пустой список", "а", "б", "в", 3), [],
    ),
    (
        ("ПРИДУМАЛ пусть будет NONE", "аа", "п", "в", 2), None,
    )
    
)


def test(f, cases):
    tests_completed = 0
    for i, t in enumerate(cases):
        a, b = t
        try:
            assert f(*a) == b
        except AssertionError as e:
            print(f"[test {i + 1}]: Ошибка в тесте.\n -> Ожидалось: {b} \n -> Получено: {f(*a)}")
        except Exception as e:
            print(f"[test {i + 1}]: Ошибка выполнения программы: {e}")
        else:
            tests_completed += 1
    else:
        print(f"Тестов пройдено: {tests_completed}/{len(cases)}")


print("Задача 1")
test(task_1, TEST_CASES_1)

print("Задача 2")
test(task_2, TEST_CASES_2)

print("Задача 3")
test(task_3, TEST_CASES_3)